optimize chart
